sludgeFallingInWater/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)     //0
    (-20 0 0)   //1
    (-20 20 0)  //2
    (0 20 0)    //3
    (40 20 0)   //4
    (60 20 0)   //5
    (60 0 0)    //6
    (40 0 0)    //7
    (40 -40 0)  //8
    (0 -40 0)   //9

    (0 0 1)     //0
    (-20 0 1)   //1
    (-20 20 1)  //2
    (0 20 1)    //3
    (40 20 1)   //4
    (60 20 1)   //5
    (60 0 1)    //6
    (40 0 1)    //7
    (40 -40 1)  //8
    (0 -40 1)   //9
    

    


);

blocks
(
    hex (10 11 12 13 0 1 2 3) (20 20 1) simpleGrading (1 1 1)   //0
    hex (17 10 13 14 7 0 3 4) (40 20 1) simpleGrading (1 1 1)   //1
    hex (16 17 14 15 6 7 4 5) (20 20 1) simpleGrading (1 1 1)   //2
    hex (18 19 10 17 8 9 0 7) (40 40 1) simpleGrading (1 1 1)   //3

);

edges
(
);

boundary
(

    walls
    {
        type wall;
        faces
        (
        (8 18 17 7)
        (9 0 10 19)
        (9 8 18 19)
        (2 3 13 12)
        (3 4 14 13)
        (4 5 15 14)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
